# Задача 4: Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N.
# Пример 10: 0, 1, 2, 3

n = int(input('Введите число N: '))
p = 0
str_0 = []

while 2**p <= n:
    a = p
    p += 1
    str_0.append(a)

print(f'{n}: {str_0}')

